<p style="font-size:30px; text-align:center; line-height:120%">
<br>
COMS W 4111-02, H02, V02<br>
Introduction to Databases<br>
Spring 2019 Take Home Midterm
</p>

# Exam Overview and Instructions

- Homework assignments and exams have point values. Final grade depends on total point value. The range of total possible points for a semester is 0 to 100 points (not including extra-credit).
    - The grade for this midterm is in the range 0 to 100.
    - __This midterm exam is worth 20 points__ for your final semester points total. So, divide your score on this exam by 5 to determine point contribution.


- Submission:
    - The exam is due on 27-Oct-2019 at 11:59PM. __You may not use grace days.__
    - Submission:
        - Submission format a copy of this Jupyter Notebook with your solutions entered into the code cells or Markdown cells for each question. If you embed images or diagrams, you may need to use a zip file to include the images in the notebook.
        - You submit your homework on CourseWorks under "Midterm Examination" assignment.
        - No other formats are allowed.
        - If the notebook format is incorrect or the notebook is corrupted, the grade is 0.
        - Submissions after the due date and time are not allowed. Submissions not received on time receive a grade of 0.
    - Respect for the individual is paramount. We will accommodate special circumstances, but we must be notified and discuss __in advance.__
    

- Exam Rules:
    - Please read and review the [Academic Integrity policy and guidelines](https://www.college.columbia.edu/academics/academicintegrity), including subsections and details. This material defines the rules for this exam regardless of your school.
    - No collaboration of any form is permitted. You may not share material of any form, including links to on-line information, __information from the preparatory recitation section,__ suggestions or ideas, etc.
    - You __MAY__ use material from office hours or recitations.
    - You MAY use any on-line information you find, but may not directly use code you find. You must cite any on-line sources in the comments Markdown cell for each questions.
    - You must privately send comments or questions to Professor Ferguson via email. If questions or comments demonstrate a need for clarification or correction, Prof. Ferguson will update this document and send an email notification.
    - You may not discuss the exam on Piazza. The CA or professor may post clarifying comment on Piazza.

- Completing the exam:
    - Environment:
        - You must install [iPython-SQL](https://github.com/catherinedevlin/ipython-sql). Lecture notebooks have included iPython-SQL since lecture 1. There are installation instructions on the iPython-SQL web site and in lecture notes. __Note:__ You must install into your Anaconda environment, and not other system Python environments.
        - You will need to use several databases/schemas for the homework. You will need to use lahman2019clean, which you had to install for HW2. You will also need [classicmodels](http://www.mysqltutorial.org/mysql-sample-database.aspx). You need to install both databases, if you have not. You MUST use the schema/database names lahman2019clean and classmodels.
        - You must have a user ID dbuser with password dbuserdbuser and use in any connections you make completing questions.
        - Section 2 tests the setup of your environment. You __MUST USE__  dbuser:dbuserdbuser@localhost/lahman2019. 
        - Your database __MUST HAVE__ a user ```dbuser``` with pasword ```dbuserdbuser```
    - Each question starts with an explanation of the structure of the answer, e.g. prose, diagram, SQL, etc.
    - Questions requiring SQL or code have empty text cells where you enter your statements. Some also contain sample answers to help you determine if your answer is correct. You must show the execution of your SQL in your submission. You may use LIMIT 10 to reduce the size of results.

You may include diagrams in text/Markdown cells when answering a question. You can include a diagram using an HTML tag of the form:<br><br>

```<img src="./filename.file_extension">```

<br>
The example below between the horizontal lines includes an image. You can click on the cell to see the Markdown code for including the image. <b>You will have to submit a zip file containing the notebook and you image if you include diagrams or images in your submission.</b>
<br><br>

<hr style="height:2px;">

- Double click in between lines to see the Markdown example for including a diagram.
<br><br>
<img src="./Columbia_University_logo.jpg">
<br><br>
<hr style="height:2px;">

<span style="font-size:24px; color:red; line-height:1.2;">Note:</span>

- <span style="color:red;">Not all questions with the same point value are equally hard. </span>


- <span style="color:red;">One five point question might be much easier than another five point question.</span>


- <span style="color:red;">A ten point question is not always exactly twice as hard as a five point question.</span>


- <span style="color:red;">Students sometimes complain about the discrepancy in difficulty and value.</span>


- <span style="color:red;">I am sensitive to the concern. I am happy to resolve this complaint by redoing the exam to make all five point questions as hard as the hardest five point question, and all ten point questions as hard as the hardest ten point question.</span>


- <span style="color:red;">Just let me know.</span>

# Environment Test

This section tests the environment. You must change the "userid:pw" to the correct user ID and password for your MySQL instance. Please change back to "userid:pw" before submitting your exam. Unless you have received an exception, you __MUST USE dbuser:dbuserdbuser.__

## SQL Magic Plugin

#### Please use Restart and Run All to test my code (or at least for every problem, run from its first cell)
#### This is because I use a lot of  `USE {lahman2019clean, classicalmodels, w4111midterm} ` MySQL statement in my code

In [1]:
# !pip install ipython-sql
# !pip install pymysql

In [2]:
%load_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/lahman2019clean
        
%sql select * from people where playerid='willite01'

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('willite01', '1918', '8', '30', 'USA', 'CA', 'San Diego', '2002', '7', '5', 'USA', 'FL', 'Inverness', 'Ted', 'Williams', 'Theodore Samuel', 205, '75', 'L', 'R', '1939-04-20', '1960-09-28', 'willt103', 'willite01', datetime.datetime(1918, 8, 30, 0, 0), datetime.datetime(2002, 7, 5, 0, 0))]

In [3]:
%sql select * from classicmodels.customers where customerNumber=103

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, Decimal('21000.00'))]

## Python Connection

In [4]:
import json
import pymysql
import logging

logging.basicConfig(level=logging.DEBUG)
logger = logging.getLogger()
logger.setLevel(logging.DEBUG)

midterm_conn = pymysql.connect(
    host="localhost",
    user="dbuser",
    password="dbuserdbuser",
    cursorclass=pymysql.cursors.DictCursor)

In [5]:
import logging


def run_q(sql, args=None, fetch=True, cur=None, conn=midterm_conn, commit=True):
    '''
    Helper function to run an SQL statement.

    This is a modification that better supports HW1. An RDBDataTable MUST have a connection specified by
    the connection information. This means that this implementation of run_q MUST NOT try to obtain
    a defailt connection.

    :param sql: SQL template with placeholders for parameters. Canno be NULL.
    :param args: Values to pass with statement. May be null.
    :param fetch: Execute a fetch and return data if TRUE.
    :param conn: The database connection to use. This cannot be NULL, unless a cursor is passed.
        DO NOT PASS CURSORS for HW1.
    :param cur: The cursor to use. This is wizard stuff. Do not worry about it for now.
        DO NOT PASS CURSORS for HW1.
    :param commit: This is wizard stuff. Do not worry about it.

    :return: A pair of the form (execute response, fetched data). There will only be fetched data if
        the fetch parameter is True. 'execute response' is the return from the connection.execute, which
        is typically the number of rows effected.
    '''

    cursor_created = False
    connection_created = False

    try:

        if conn is None:
            raise ValueError("In this implementation, conn cannot be None.")

        if cur is None:
            cursor_created = True
            cur = conn.cursor()

        if args is not None:
            log_message = cur.mogrify(sql, args)
        else:
            log_message = sql

        logger.debug("Executing SQL = " + log_message)

        res = cur.execute(sql, args)

        if fetch:
            data = cur.fetchall()
        else:
            data = None

        # Do not ask.
        if commit == True:
            conn.commit()

    except Exception as e:
        raise(e)

    return (res, data)

In [6]:
q = "select playerID, nameLast, nameFirst from lahman2019clean.people where nameLast=%s and birthCity=%s"
res,d = run_q(q, args=('Williams', 'San Diego'))

print("Data = ", json.dumps(d, indent=2))

DEBUG:root:Executing SQL = select playerID, nameLast, nameFirst from lahman2019clean.people where nameLast='Williams' and birthCity='San Diego'

Data =  [
  {
    "playerID": "willite01",
    "nameLast": "Williams",
    "nameFirst": "Ted"
  },
  {
    "playerID": "willitr01",
    "nameLast": "Williams",
    "nameFirst": "Trevor"
  }
]

# Written Questions

Each question is worth 5 points.

## Benefits of Database Management Systems

- Prior to database management systems (DBMS), user relied on application programs that directly access files to create, retrieve and update shared data.


- Give five benefits of using a database management system to provide data access for applications.


- One or two sentences is sufficient for each answer.


- Double click on the number to open the Markdown cell.

<u>Answer</u>

1. DBMS prevents data inconsistency when data is used by different users. When relying on application programs, each user keeps their own copy of the data (not centralized). Thus, when a user updates the data, the change doesn't reflect to other users that also use the same data. Meanwhile, DBMS uses a single repository where changes can be reflected to all users, hence preventing inconsistency. 
<br>

2. DBMS preserves data integrity, e.g. for a salary data, we can only insert numeric values. This is done by specifying the data type, e.g integer. Meanwhile, when relying on application programs, there is no default constraint checking mechanism and we need to handle the logic within the application program.
<br>

3. DBMS provides a convenient and uniform mechanism to perform data searching, which is through querying. This is possible because the data in DBMS is structured. On the other hand, when relying on application programs, we need to write different code to search on different types of files.
<br>

4. DBMS can handle concurrency, a situation when multiple users access or update a data at the same time. When relying on application program, a problem that might occur is lost update (change made by a user is lost because there is another change performed at the same time). DBMS prevents that by using some kind of protocol (two phase locking, timestamp based, etc.). 
<br>

5. DBMS provides mechanism to manage data security, i.e. it allows us to define which user can access which data and also what kind of operations can be performed (read, write, update, delete). DBMS also enables data independence, i.e. change in the data representation/storage doesn't require the application programs to also change.
<br>

Reference: 

1. https://opentextbc.ca/dbdesign01/chapter/chapter-1-before-the-advent-of-database-systems/
2. https://www.geeksforgeeks.org/advantages-of-dbms-over-file-system/
3. https://www.guru99.com/dbms-concurrency-control.html

## Relational Concepts

Briefly explain _Cartesian product, equijoin, natural join,_ and _theta join._

<u>Answer</u>

1. _Cartesian product_ between two tables will pair each row in the first table with each row in the second table. There is no condition or constraint to comply during the process. For example, looking at example of `BirthInfo` and `AstrologicalInfo` below, the cartesian product will result in 20 rows as there are 5 rows in `BirthInfo` and 4 rows in `AstrologicalInfo`. The resulting rows will have all the columns from both tables, which are 4 columns in total (`Name`, `BirthInfo.Month`, `AstrologicalInfo.Month` and `Sign`).
<br>

2. _Theta join_ between two tables will do the cartesian product but only for row pairs that follow some arbitrary comparison relationships (>=, <, etc.), i.e. the theta condition. For example, we can specify to only include rows from table `BirthInfo` and `AstrologicalInfo` where the `Month` is "greater than" May (June, July and so on). This theta join will result in 9 rows because there are 3 rows both in `BirthInfo` and `AstrologicalInfo` that satisfy the condition.
<br>

3. _Equijoin_ is basically theta join with equality operator (=). For example, we can have equijoin on `BirthInfo.Month = AstrologicalInfo.Month`. This will result in 4 rows because there is one exact match in table `AstrologicalInfo` for every row in table `BirthInfo` except for the row `(Kirit, May)`. In equijoin, the column names from each table to compare don't have to be the same. Another thing to note is that in the result, the joined column from both tables will be kept. In our example before, it means that there will be two `Month` columns in the resulting table.
<br>

4. _Natural join_ works in the same way as equijoin, but in this case we don't have to specify the columns. Natural join will automatically do the join based on a common column/attribute from both tables, i.e. the column with the same name in each table. Another difference between natural join and equijoin is that in the resulting rows, there will only be one `Month` column (duplicate column is removed).

Reference:

1. https://www.tutorialspoint.com/dbms/database_joins.htm
2. https://stackoverflow.com/questions/7870155/difference-between-a-theta-join-equijoin-and-natural-join/7870216

## Relational Algebra

Use the following tables when answering this question.

| Name    | Month |
|--------|-----------|
| Don | September |
| Meghna | June      |
| Aly    | January   |
| Ara    | September |
| Kirit  | May       |
|| __BirthInfo__ |



| Month | Sign |
|-----------|-----------|
| January   | Acquarius |
| September | Virgo     |
| June      | Gemini    |
| July      | Leo       |
|| __AstrologicalInfo__ |


Give the result of each of the relational algebra statements. You can provide your answer in text in the form:
<br><br>
column name, column name, ..., column name<br>
value, value, ..., value<br>
value, value, ..., value<br>
value, value, ..., value<br>

<span style="font-size:20px;">1. $\sigma_{Month="September"}(BirthInfo)\ \bowtie \ \pi_{Sign}(\sigma_{Month<"September"})(AstrologicalInfo))$</span>
<br><br>
<u>Answer</u>

```
Name, Month, Sign

Don, September, Acquarius
Don, September, Gemini
Don, September, Leo
Ara, September, Acquarius
Ara, September, Gemini
Ara, September, Leo
```

<span style="font-size:20px;">2. $\pi_{Name}(\sigma_{Month="December"}(AstrologicalInfo))$</span>
<br><br>
<u>Answer</u>

```
Name

NULL
```

<span style="font-size:20px;">
    3. $BirthInfo \\ \bowtie_{BirthInfo.Month=AstrologicalInfo.Month} \\ AstrologicalInfo$
</span>
<br><br>
<u>Answer</u>

Assumption: Natural join usually does not use any comparison operator, so I assume this is an equijoin. Hence, both `Month` columns are kept. 

```
Name, BirthInfo.Month, AstrologicalInfo.Month, Sign

Don, September, September, Virgo
Meghna, June, June, Gemini
Aly, January, January, Acquarius
Ara, September, September, Virgo

```

<span style="font-size:20px;">4. $\pi_{Month}(BirthInfo) \land   \pi_{Month}(AstrologicalInfo) $</span>
<br><br>
<u>Answer</u>

```
Month

January
June
September

```

<span style="font-size:20px;">5. Produce an SQL statement that is equivalent to $Student( \underline{UNI}, last\_name, first\_name, email)$</span>
<br><br>
<u>Answer</u>

```
CREATE TABLE Student (
    UNI varchar(12) NOT NULL,
    last_name varchar(32) NOT NULL,
    first_name varchar(32) NOT NULL,
    email varchar(64) NOT NULL,
    PRIMARY KEY (UNI)
);
```

## Relational Semantics

Provide a short (at most five sentences) answer to the following questions.

```1.``` __Codd's Twelve Rules__ define what it means for a DBMS to be relational. Briefly explain Rule 3, "Systematic treatment of null values."

<u>Answer</u>

This rule states that DBMS must allow a field to be NULL independently of the data type. NULL is used to say that a field is missing, not applicable or we don't know its value. We can't use some regular values to express those three conditions. For example, we can't use -1 to say that an integer field is not known or use an empty string to say than a text field is not known. NULL representation must also be manipulated by the DBMS in a systematic way, e.g. any expression involving NULL will return NULL.

References: 
1. https://www.tutorialspoint.com/dbms/dbms_codds_rules.htm
2. https://it.toolbox.com/blogs/ralphwilson/what-about-rule-3-systematic-treatment-of-null-values-061015

```2.``` In a relational model, the domain for an attribute must be _atomic._ Briefly explain what this means. Given an example of a domain that is not atomic.

<u>Answer</u>

The domain of an attribute is said to be _atomic_ if its value cannot be divided into smaller units, i.e it is the smallest indivisible unit. For example, using the example of BirthInfo table in the previous problem, suppose we combine two rows `Don, September` and `Ara, September` so that we have a row such as below:
```
Name; Month

Don, Ara; September
```

The domain for attribute `Name` in this row is not atomic because its value consists of two names, `Don, Ara`, which can be divided into two smaller units as in the original BirthInfo table. A table that contains only atomic values is in the 1st Normal Form (1NF).

Reference:
1. https://www.1keydata.com/database-normalization/first-normal-form-1nf.php

```3.``` Briefly explain _super key, candidate key,_ and _primary key._

<u>Answer</u>

Let's take the `Student` table from the previous problem: $Student( \underline{UNI}, last\_name, first\_name, email)$ as an example. Suppose that `UNI` and `email` are unique.
<br>

1. _Super key_ is a set of attributes that is used to uniquely identify a row in a table. Note that super key may contain extraneous attributes. In other words, super key may contain attributes that if they are excluded, it still works (it still can identify a row uniquely). Some valid super keys for `Student` are `(UNI, last_name, first_name)` and `(first_name, email)`. 
<br>

2. _Candidate key_ is the subset of super key that doesn't contain extraneous information. A candidate key is definitely a super key but not vice versa. For `Student`, there can be two super keys: `(UNI)` and `(email)`.
<br>

3. _Primary key_ is one candidate key (out of possibly many) that is selected to officially identify tuples uniquely within a table. For example, we can take `(UNI)` instead of `(email)` as the primary key for `Student` table.
<br>

References:
1. https://www.geeksforgeeks.org/types-of-keys-in-relational-model-candidate-super-primary-alternate-and-foreign/

```4.``` Briefly (two or three sentences) explain the following concepts: _domain constraint, table integrity constraints, referential integrity constraints._

<u>Answer</u>

1. Domain constraint is the valid set of values for an attribute. Some example of domains are string, integer, time, date and enum. A constraint violation would be, for example, when we try to insert an integer value for an attribute of string domain.
<br>

2. Table integrity constraint makes sure that the primary key value is not `NULL`. Primary key is used to identify individual row in the table, so if it is `NULL`, then we can't identify any rows.
<br>

3. Referential integrity constraint involves two tables. This constraint states that if Table 1 has a foreign key pointing to Table 2, then every row's foreign key in Table 1 must exist as a row's primary key in Table 2.

References:
1. https://www.javatpoint.com/dbms-integrity-constraints

```5.``` What are referential integrity _cascading deletes_ and _cascading updates?_

<u>Answer</u>

Suppose Table 1 has a foreign key referring to Table 2. Let's call Table 1 as "child" table and Table 2 as "parent" table. Then:

1. _Cascading deletes_ mean that if we delete a row in the Table 1, then all the rows in Table 2 that have the corresponding foreign key will also be deleted automatically. Shortly put, when we delete the parent, all the childs will also be deleted.
<br>

2. _Cascading updates_ mean that if we update the primary key value of a row in Table 1, then all the rows in Table 2 that point to that row will have their foreign key updated into the new primary key. Shortly put, when we update the parent, all the childs will also be updated.
<br>

References:
1. https://www.sqlshack.com/delete-cascade-and-update-cascade-in-sql-server-foreign-key/

# SQL Data Manipulation Language Questions

##  Batter Performance for Red Sox in 1960 (5 points)

- This query requires the following columns from ```Lahman2019clean:```
    - ```people.playerid, people.nameLast, people.bats```
    - ```batting.playerid, batting.ab, batting.h, batting.bb, batting.hr, batting.teamid, batting.yearid, batting.2b, batting.3b, batting.HR```
    
    
- The formula for on-base percentage is (H + BB)/(H + AB). We will denote on-base percentage as ```OBP.```
- Correction: (H+BB)/(BB+AB) 


- Batting average is H/AB. We will denote this as AVG.


- Slugging Percentage:
    - In the ```Batting``` table, ```H``` is total hits.
    - The table lists three types of hits ```2B`` is doubles, ```3B``` is triples and ```HR``` is homeruns.
    There is a fourth type of hit, _singles_ that contributes to total hits but is not in the table. We will call this ```1B```
    - The formulate for slugging percentage, which we will denote as SLG, is<br><br>
\begin{equation}
\frac{1B + 2*2B + 3*3B + 4*HR}{AB}
\end{equation}


- The following table summarizes batting performance for BOS in 1960 for the top ten hitters, ordered by SLG. Write and execute the SQL to produce the table.

<u>Your query and execution</u>

In [7]:
%%sql 
USE lahman2019clean;

SELECT t1.playerID, nameLast, bats, H, AB, 1B, 2B, 3B, HR, RBI, AVG, OBP, 
ROUND(((1B + (2 * 2B) + (3 * 3B) + (4 * HR)) / AB), 3) AS SLG 
FROM 
    (SELECT playerID, nameLast, bats FROM people) AS t1 
    INNER JOIN 
    (SELECT playerID, H, AB, (H - 2B - 3B - HR) AS 1B, 2B, 3B, HR, RBI, 
     ROUND((H / AB), 3) AS AVG, ROUND(((H + BB) / (BB + AB)), 3) AS OBP 
     FROM batting WHERE teamID = 'BOS' AND yearID = '1960') AS t2 
ON t1.playerID = t2.playerID ORDER BY SLG DESC LIMIT 10 ;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
10 rows affected.

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1365, 'Division by 0')
  result = self._query(query)

[('willite01', 'Williams', 'L', '98', '310', 54.0, '15', '0', '29', '72', 0.316, 0.449, 0.645),
 ('pagliji01', 'Pagliaroni', 'R', '19', '62', 10.0, '5', '2', '2', '9', 0.306, 0.427, 0.548),
 ('geigega01', 'Geiger', 'L', '74', '245', 49.0, '13', '3', '9', '33', 0.302, 0.362, 0.49),
 ('wertzvi01', 'Wertz', 'L', '125', '443', 84.0, '22', '0', '19', '103', 0.282, 0.338, 0.46),
 ('thomsbo01', 'Thomson', 'R', '30', '114', 21.0, '3', '1', '5', '20', 0.263, 0.328, 0.439),
 ('nixonru01', 'Nixon', 'L', '81', '272', 56.0, '17', '3', '5', '33', 0.298, 0.33, 0.438),
 ('fornimi01', 'Fornieles', 'R', '6', '15', 6.0, '0', '0', '0', '1', 0.4, 0.4, 0.4),
 ('malzofr01', 'Malzone', 'R', '161', '595', 115.0, '30', '2', '14', '79', 0.271, 0.312, 0.398),
 ('runnepe01', 'Runnels', 'L', '169', '528', 136.0, '29', '2', '2', '35', 0.32, 0.401, 0.394),
 ('tasbywi01', 'Tasby', 'R', '108', '385', 83.0, '17', '1', '7', '37', 0.281, 0.365, 0.384)]

<u>My Answer</u>

```
USE lahman2019clean;

SELECT t1.playerID, nameLast, bats, H, AB, 1B, 2B, 3B, HR, RBI, AVG, OBP, 
ROUND(((1B + (2 * 2B) + (3 * 3B) + (4 * HR)) / AB), 3) AS SLG 
FROM 
    (SELECT playerID, nameLast, bats FROM people) AS t1 
    INNER JOIN 
    (SELECT playerID, H, AB, (H - 2B - 3B - HR) AS 1B, 2B, 3B, HR, RBI, 
     ROUND((H / AB), 3) AS AVG, ROUND(((H + BB) / (BB + AB)), 3) AS OBP 
     FROM batting WHERE teamID = 'BOS' AND yearID = '1960') AS t2 
ON t1.playerID = t2.playerID ORDER BY SLG DESC LIMIT 10 ;
```

## Set Membership (5 points)

- This query involves the lahman2019clean tables ```halloffame, people, appearances, pitching, managers.```


- Return the ```playerID, nameLast, nameFirst``` for every person that is in all of the tables.

<u>Your query and execution</u>

In [8]:
%%sql 
USE lahman2019clean;

SELECT playerID, nameFirst, nameLast FROM people WHERE playerID IN ( 
    SELECT DISTINCT playerID FROM appearances WHERE playerID IN ( 
        SELECT DISTINCT playerID FROM pitching WHERE playerID IN ( 
            SELECT DISTINCT playerID FROM hallofFame WHERE playerID IN ( 
                SELECT DISTINCT playerID FROM managers 
            ) 
        ) 
    ) 
) 
ORDER BY playerID DESC LIMIT 10 ;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
10 rows affected.

[('youngcy01', 'Cy', 'Young'),
 ('wrighha01', 'Harry', 'Wright'),
 ('wrighge01', 'George', 'Wright'),
 ('willite01', 'Ted', 'Williams'),
 ('whitewi01', 'Will', 'White'),
 ('whitede01', 'Deacon', 'White'),
 ('wardjo01', 'John', 'Ward'),
 ('waltebu01', 'Bucky', 'Walters'),
 ('walshed01', 'Ed', 'Walsh'),
 ('wallabo01', 'Bobby', 'Wallace')]

<u>My Answer</u>

```
USE lahman2019clean;

SELECT playerID, nameFirst, nameLast FROM people WHERE playerID IN ( 
    SELECT DISTINCT playerID FROM appearances WHERE playerID IN ( 
        SELECT DISTINCT playerID FROM pitching WHERE playerID IN ( 
            SELECT DISTINCT playerID FROM hallofFame WHERE playerID IN ( 
                SELECT DISTINCT playerID FROM managers 
            ) 
        ) 
    ) 
) 
ORDER BY playerID DESC LIMIT 10 ;
```

## Complex Insert (10 points)


- Use ```classicmodels``` for this question.


- An order form typically looks something like:

| <img src="./order-form-103.jpg"> |
| :---: |
| __Example Order Form__ |


- For ```classicmodels``` the application user interface would ```POST``` of the form.

```
{
            "orderNumber": 10123,
            "orderDate": "2003-05-20",
            "requiredDate": "2003-05-29",
            "shippedDate": "2003-05-22",
            "status": "Shipped",
            "comments": null,
            "customerNumber": 103,
            "orderdetails": [
                {
                    "orderNumber": 10123,
                    "productCode": "S18_1589",
                    "quantityOrdered": 26,
                    "priceEach": "120.71",
                    "orderLineNumber": 2
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S18_2870",
                    "quantityOrdered": 46,
                    "priceEach": "114.84",
                    "orderLineNumber": 3
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S18_3685",
                    "quantityOrdered": 34,
                    "priceEach": "117.26",
                    "orderLineNumber": 4
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S24_1628",
                    "quantityOrdered": 50,
                    "priceEach": "43.27",
                    "orderLineNumber": 1
                }
            ]
        }

```

- This data structure maps to two tables in ```classicmodels:``` ```orders``` and ```ordersdetails```


- Complete the implementation of the Python function below that takes a data structure (dict) of the form above and inserts that data into ```classicmodels.```


<u>Answer</u>

In [9]:
def create_order(order_info):
    """
    Creates (Inserts) the data associated with an order. The order information goes into orders table and each
    and line item/order detail item goes into the ordersdetails table.
    :param order_info: A dictionary. There are top-level elements for the order. There is an orderdetails element
        that is a list of dictionary for the orderdetails elements.
    :param cnx: The database connection to use.
    :return: A tuple of the form (order_insert_count, orderdetals_insert_count), where the values are the number
        of rows inserted into each table.
    """
    
    # Check if order number already exists
    check_q = 'SELECT orderNumber FROM classicmodels.orders WHERE orderNumber=%s'
    check_res, check_data = run_q(check_q, args=(order_info['orderNumber'],))
    
    # If existing orderNumber is found, compute new orderNumber
    # Basically, just find the max orderNumber and increment it by one
    if check_res > 0:
        max_order_number_q = 'SELECT MAX(orderNumber) as max_order_number FROM classicmodels.orders;'
        max_order_number_res, max_order_number_data = run_q(max_order_number_q, args=())
        
        # If table is empty, max orderNumber is simply zero
        if max_order_number_data != None:
            if len(max_order_number_data) > 0:
                max_order_number = max_order_number_data[0]['max_order_number']
            else:
                max_order_number = 0
        else:
            max_order_number = 0
        
        # Increment orderNumber by one to get the new orderNumber
        new_order_number = max_order_number + 1
        
        # Update orderNumber value in order_info dict
        order_info['orderNumber'] = new_order_number
        
        for order_detail in order_info['orderdetails']:
            order_detail['orderNumber'] = new_order_number
        
    # Insert the order first so the primary key constraint is preserved
    insert_order_q = 'INSERT INTO classicmodels.orders VALUES (%s, %s, %s, %s, %s, %s, %s)'
    insert_order_res, insert_order_data = run_q(insert_order_q, args=(
        order_info['orderNumber'],
        order_info['orderDate'],
        order_info['requiredDate'],
        order_info['shippedDate'],
        order_info['status'],
        order_info['comments'],
        order_info['customerNumber']
    ))
    
    # Finally, insert all order details
    for order_detail in order_info['orderdetails']:
        insert_detail_q = 'INSERT INTO classicmodels.orderdetails VALUES (%s, %s, %s, %s, %s)'
        insert_detail_res, insert_detail_data = run_q(insert_detail_q, args=(
            order_detail['orderNumber'],
            order_detail['productCode'],
            order_detail['quantityOrdered'],
            order_detail['priceEach'],
            order_detail['orderLineNumber']
        ))

In [10]:
# Testing the function
# I've run this function several times, so the new orderNumber that appear in your result might be different
# from the result that is shown below. Most probably, yours will be lower than what is shown below.

order_info = {
            "orderNumber": 10123,
            "orderDate": "2003-05-20",
            "requiredDate": "2003-05-29",
            "shippedDate": "2003-05-22",
            "status": "Shipped",
            "comments": None,
            "customerNumber": 103,
            "orderdetails": [
                {
                    "orderNumber": 10123,
                    "productCode": "S18_1589",
                    "quantityOrdered": 26,
                    "priceEach": "120.71",
                    "orderLineNumber": 2
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S18_2870",
                    "quantityOrdered": 46,
                    "priceEach": "114.84",
                    "orderLineNumber": 3
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S18_3685",
                    "quantityOrdered": 34,
                    "priceEach": "117.26",
                    "orderLineNumber": 4
                },
                {
                    "orderNumber": 10123,
                    "productCode": "S24_1628",
                    "quantityOrdered": 50,
                    "priceEach": "43.27",
                    "orderLineNumber": 1
                }
            ]
        }

create_order(order_info)

DEBUG:root:Executing SQL = SELECT orderNumber FROM classicmodels.orders WHERE orderNumber=10123
DEBUG:root:Executing SQL = SELECT MAX(orderNumber) as max_order_number FROM classicmodels.orders;
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orders VALUES (10435, '2003-05-20', '2003-05-29', '2003-05-22', 'Shipped', NULL, 103)
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orderdetails VALUES (10435, 'S18_1589', 26, '120.71', 2)
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orderdetails VALUES (10435, 'S18_2870', 46, '114.84', 3)
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orderdetails VALUES (10435, 'S18_3685', 34, '117.26', 4)
DEBUG:root:Executing SQL = INSERT INTO classicmodels.orderdetails VALUES (10435, 'S24_1628', 50, '43.27', 1)

## Complex Query/View $-$ Player Performance Statistics by Year (10 points)

- Use the ```lahman2019clean``` database/schema.


- Create performance summary views. Create five views:
    - ```batting_summary:``` yearID, teamID, AB, H, HR, RBI
    - ```appearances summary:``` yearID, teamID, G_all, GS
    - ```pitching summary:``` yearID, teamID, W, L, IPouts
    - ```fielding_summary``` yearID, teamID, PO, A, E, POS
    - ```annual_summary,``` which combines the views above.
    - ```career_summary,``` which contains the totals/summaries for the entire career.
    
    
- __NOTE:__ You will need to do aggregation on some of the views to get annual values.


- __Note:__ Your query must produce the correct results for any ```playerID.```


<u>Answer</u>

- ```batting_summary```

```
Put your create view statement here.
```

In [11]:
%%sql 

USE lahman2019clean;

DROP VIEW IF EXISTS batting_summary;

CREATE VIEW batting_summary(playerID, teamID, yearID, ab, h, hr, rbi) 
AS 
    SELECT playerID, teamID, yearID, AB + 0.0, H + 0.0, HR + 0.0, RBI + 0.0 FROM batting;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [12]:
%sql select * from batting_summary where playerID='willite01';

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[('willite01', 'BOS', '1939', 565.0, 185.0, 31.0, 145.0),
 ('willite01', 'BOS', '1940', 561.0, 193.0, 23.0, 113.0),
 ('willite01', 'BOS', '1941', 456.0, 185.0, 37.0, 120.0),
 ('willite01', 'BOS', '1942', 522.0, 186.0, 36.0, 137.0),
 ('willite01', 'BOS', '1946', 514.0, 176.0, 38.0, 123.0),
 ('willite01', 'BOS', '1947', 528.0, 181.0, 32.0, 114.0),
 ('willite01', 'BOS', '1948', 509.0, 188.0, 25.0, 127.0),
 ('willite01', 'BOS', '1949', 566.0, 194.0, 43.0, 159.0),
 ('willite01', 'BOS', '1950', 334.0, 106.0, 28.0, 97.0),
 ('willite01', 'BOS', '1951', 531.0, 169.0, 30.0, 126.0),
 ('willite01', 'BOS', '1952', 10.0, 4.0, 1.0, 3.0),
 ('willite01', 'BOS', '1953', 91.0, 37.0, 13.0, 34.0),
 ('willite01', 'BOS', '1954', 386.0, 133.0, 29.0, 89.0),
 ('willite01', 'BOS', '1955', 320.0, 114.0, 28.0, 83.0),
 ('willite01', 'BOS', '1956', 400.0, 138.0, 24.0, 82.0),
 ('willite01', 'BOS', '1957', 420.0, 163.0, 38.0, 87.0),
 ('willite01', 'BOS', '1958', 411.0, 135.0, 26.0, 85.0),
 ('willite01', 'BOS', '1959', 272.0, 69.0, 10.0, 43.0),
 ('willite01', 'BOS', '1960', 310.0, 98.0, 29.0, 72.0)]

- ```Pitching summary```

```
Put create view statement here.
```

In [13]:
%%sql 

DROP VIEW IF EXISTS pitching_summary;

CREATE VIEW pitching_summary(playerID, teamID, yearID, w, l, IPouts) 
AS
    SELECT playerID, teamID, yearID, w + 0.0, l + 0.0, IPouts + 0.0 FROM pitching;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.

[]

In [14]:
# Doesn't include g_p as instructed in exam clarification Piazza post
%sql select * from pitching_summary where playerid='willite01';

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('willite01', 'BOS', '1940', 0.0, 0.0, 6.0)]

- ```fielding summary```

```
Put create view statement here.
```

In [15]:
%%sql 

DROP VIEW IF EXISTS fielding_summary;

CREATE VIEW fielding_summary (playerID, teamID, yearID, po, a, e, `group_concat(pos)`) 
AS 
    SELECT playerID, teamID, yearID, SUM(PO), SUM(A), SUM(E), GROUP_CONCAT(DISTINCT POS) 
    FROM fielding GROUP BY playerID, teamID, yearID;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.

[]

In [16]:
%sql select * from fielding_summary where playerid='willite01';

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[('willite01', 'BOS', '1939', 318.0, 11.0, 19.0, 'OF'),
 ('willite01', 'BOS', '1940', 302.0, 15.0, 13.0, 'OF,P'),
 ('willite01', 'BOS', '1941', 262.0, 11.0, 11.0, 'OF'),
 ('willite01', 'BOS', '1942', 312.0, 15.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1946', 325.0, 7.0, 10.0, 'OF'),
 ('willite01', 'BOS', '1947', 347.0, 10.0, 9.0, 'OF'),
 ('willite01', 'BOS', '1948', 289.0, 9.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1949', 337.0, 12.0, 6.0, 'OF'),
 ('willite01', 'BOS', '1950', 165.0, 7.0, 8.0, 'OF'),
 ('willite01', 'BOS', '1951', 315.0, 12.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1952', 4.0, 0.0, 0.0, 'OF'),
 ('willite01', 'BOS', '1953', 31.0, 1.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1954', 213.0, 5.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1955', 170.0, 5.0, 2.0, 'OF'),
 ('willite01', 'BOS', '1956', 174.0, 7.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1957', 215.0, 2.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1958', 154.0, 3.0, 7.0, 'OF'),
 ('willite01', 'BOS', '1959', 94.0, 4.0, 3.0, 'OF'),
 ('willite01', 'BOS', '1960', 131.0, 6.0, 1.0, 'OF')]

- ```appearances_summary```

```
Put create view statement here.
```

In [17]:
%%sql 

DROP VIEW IF EXISTS appearances_summary;

CREATE VIEW appearances_summary (playerID, teamID, yearID, G_all, GS)
AS
    SELECT playerID, teamID, yearID, G_all, GS FROM appearances;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.

[]

In [18]:
%sql select * from appearances_summary where playerid = 'willite01';

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[('willite01', 'BOS', '1939', '149', '149'),
 ('willite01', 'BOS', '1940', '144', '143'),
 ('willite01', 'BOS', '1941', '143', '133'),
 ('willite01', 'BOS', '1942', '150', '150'),
 ('willite01', 'BOS', '1946', '150', '150'),
 ('willite01', 'BOS', '1947', '156', '156'),
 ('willite01', 'BOS', '1948', '137', '134'),
 ('willite01', 'BOS', '1949', '155', '155'),
 ('willite01', 'BOS', '1950', '89', '86'),
 ('willite01', 'BOS', '1951', '148', '147'),
 ('willite01', 'BOS', '1952', '6', '2'),
 ('willite01', 'BOS', '1953', '37', '26'),
 ('willite01', 'BOS', '1954', '117', '113'),
 ('willite01', 'BOS', '1955', '98', '93'),
 ('willite01', 'BOS', '1956', '136', '110'),
 ('willite01', 'BOS', '1957', '132', '125'),
 ('willite01', 'BOS', '1958', '129', '114'),
 ('willite01', 'BOS', '1959', '103', '75'),
 ('willite01', 'BOS', '1960', '113', '87')]

- ```annual_summary```

```
Put create view satement here.
```

##### Explanation:

1. The idea is to do `LEFT JOIN` using every view that we have created above (4 in total). <br> 
We don't need to do `FULL OUTER JOIN` to make sure all desired rows are included, I will explain below.<br> 
<br> 
2. The tricky thing though, we should use `appearances_summary` as the first (left-most) view. <br>
This is because `appearances_summary` contains every possible `playerID, teamID and yearID`. <br>
<br> 
3. We can simply use this query on every view:
```
SELECT COUNT(DISTINCT playerID, teamID, yearID) FROM {appearances, batting, fielding, pitching}_summary;
```
and we can see `appearances_summary` has the most distinct values for `playerID, teamID and yearID`. <br>
<br> 
4. Thus, if we place `appearances_summary` as the left-most view, we make sure that all possible values for `playerID, teamID and yearID` are included and we can avoid `FULL OUTER JOIN` which is too heavy.

5. Join is based on `playerID, teamID, yearID` and not just `playerID, yearID` (https://piazza.com/class/jy3jm0i73f8584?cid=575)

In [19]:
%%sql

DROP VIEW IF EXISTS annual_summary;

CREATE VIEW annual_summary AS 
    SELECT appearances_summary.playerID, appearances_summary.teamID, appearances_summary.yearID, 
    G_all, appearances_summary.GS, ab, batting_summary.h, batting_summary.hr, rbi, 
    w, l, IPouts, po, a, e, `group_concat(pos)` FROM appearances_summary
    LEFT JOIN batting_summary ON appearances_summary.playerID = batting_summary.playerID AND appearances_summary.teamID = batting_summary.teamID AND appearances_summary.yearID = batting_summary.yearID
    LEFT JOIN fielding_summary ON batting_summary.playerID = fielding_summary.playerID AND batting_summary.teamID = fielding_summary.teamID AND batting_summary.yearID = fielding_summary.yearID
    LEFT JOIN pitching_summary ON fielding_summary.playerID = pitching_summary.playerID AND fielding_summary.teamID = pitching_summary.teamID AND fielding_summary.yearID = pitching_summary.yearID
;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.

[]

In [20]:
# Doesn't include g_p as instructed in exam clarification Piazza post (https://piazza.com/class/jy3jm0i73f8584?cid=575)
%sql select * from annual_summary where playerid='willite01';

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[('willite01', 'BOS', '1939', '149', '149', 565.0, 185.0, 31.0, 145.0, None, None, None, 318.0, 11.0, 19.0, 'OF'),
 ('willite01', 'BOS', '1940', '144', '143', 561.0, 193.0, 23.0, 113.0, 0.0, 0.0, 6.0, 302.0, 15.0, 13.0, 'OF,P'),
 ('willite01', 'BOS', '1941', '143', '133', 456.0, 185.0, 37.0, 120.0, None, None, None, 262.0, 11.0, 11.0, 'OF'),
 ('willite01', 'BOS', '1942', '150', '150', 522.0, 186.0, 36.0, 137.0, None, None, None, 312.0, 15.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1946', '150', '150', 514.0, 176.0, 38.0, 123.0, None, None, None, 325.0, 7.0, 10.0, 'OF'),
 ('willite01', 'BOS', '1947', '156', '156', 528.0, 181.0, 32.0, 114.0, None, None, None, 347.0, 10.0, 9.0, 'OF'),
 ('willite01', 'BOS', '1948', '137', '134', 509.0, 188.0, 25.0, 127.0, None, None, None, 289.0, 9.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1949', '155', '155', 566.0, 194.0, 43.0, 159.0, None, None, None, 337.0, 12.0, 6.0, 'OF'),
 ('willite01', 'BOS', '1950', '89', '86', 334.0, 106.0, 28.0, 97.0, None, None, None, 165.0, 7.0, 8.0, 'OF'),
 ('willite01', 'BOS', '1951', '148', '147', 531.0, 169.0, 30.0, 126.0, None, None, None, 315.0, 12.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1952', '6', '2', 10.0, 4.0, 1.0, 3.0, None, None, None, 4.0, 0.0, 0.0, 'OF'),
 ('willite01', 'BOS', '1953', '37', '26', 91.0, 37.0, 13.0, 34.0, None, None, None, 31.0, 1.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1954', '117', '113', 386.0, 133.0, 29.0, 89.0, None, None, None, 213.0, 5.0, 4.0, 'OF'),
 ('willite01', 'BOS', '1955', '98', '93', 320.0, 114.0, 28.0, 83.0, None, None, None, 170.0, 5.0, 2.0, 'OF'),
 ('willite01', 'BOS', '1956', '136', '110', 400.0, 138.0, 24.0, 82.0, None, None, None, 174.0, 7.0, 5.0, 'OF'),
 ('willite01', 'BOS', '1957', '132', '125', 420.0, 163.0, 38.0, 87.0, None, None, None, 215.0, 2.0, 1.0, 'OF'),
 ('willite01', 'BOS', '1958', '129', '114', 411.0, 135.0, 26.0, 85.0, None, None, None, 154.0, 3.0, 7.0, 'OF'),
 ('willite01', 'BOS', '1959', '103', '75', 272.0, 69.0, 10.0, 43.0, None, None, None, 94.0, 4.0, 3.0, 'OF'),
 ('willite01', 'BOS', '1960', '113', '87', 310.0, 98.0, 29.0, 72.0, None, None, None, 131.0, 6.0, 1.0, 'OF')]

In [21]:
# Example when a player can play for different team for the same year
%sql select * from annual_summary where playerid='berrych01';

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
3 rows affected.

[('berrych01', 'ALT', '1884', '7', '', 25.0, 6.0, 0.0, 0.0, None, None, None, 16.0, 9.0, 4.0, '2B'),
 ('berrych01', 'CHU', '1884', '7', '', 27.0, 3.0, 0.0, 0.0, None, None, None, 20.0, 20.0, 8.0, '2B'),
 ('berrych01', 'KCU', '1884', '29', '', 118.0, 29.0, 1.0, 0.0, None, None, None, 79.0, 60.0, 18.0, '2B,3B,OF')]

- ```career_summary```

```
Put create view statement here.
```

##### Explanation:

The idea is simpy to just use `annual_summary` view, do all the aggregations (typically `SUM`) and group them by `playerID`. 
<br><br>
The tricky thing though, is to make sure column `positions` doesn't include duplicate `pos`. <br><br> 
In this case, I do that using a temporary view and some MySQL string operations (`CONCAT`, `LOCATE` and `TRIM`).

In [22]:
%%sql

DROP VIEW IF EXISTS career_summary_temp;

CREATE VIEW career_summary_temp (playerID, G_all, GS, ab, h, hr, rbi, w, l, IPouts, po, a, e, positions_temp)
AS 
	SELECT playerID, SUM(G_all), SUM(GS), SUM(ab), SUM(h), SUM(hr), SUM(rbi), SUM(w), 
    SUM(l), SUM(IPouts), SUM(po), SUM(a), SUM(e), GROUP_CONCAT(DISTINCT `group_concat(pos)`)
    FROM annual_summary 
    GROUP BY playerID
;

DROP VIEW IF EXISTS career_summary;

CREATE VIEW career_summary (playerID, G_all, GS, ab, h, hr, rbi, w, l, IPouts, po, a, e, positions)
AS 
	SELECT playerID, G_all, GS, ab, h, hr, rbi, w, l, IPouts, po, a, e,
    TRIM( TRAILING ',' FROM
        CONCAT(IF(LOCATE('1B', positions_temp), '1B,', ''), IF(LOCATE('2B', positions_temp), '2B,', ''),
        IF(LOCATE('3B', positions_temp), '3B,', ''), IF(LOCATE('C', positions_temp), 'C,', ''),
        IF(LOCATE('OF', positions_temp), 'OF,', ''), IF(LOCATE('P', positions_temp), 'P,', ''),
        IF(LOCATE('SS', positions_temp), 'SS,', ''))
    )
    FROM career_summary_temp
;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [23]:
# Doesn't include g_p as instructed in exam clarification Piazza post (https://piazza.com/class/jy3jm0i73f8584?cid=575)
%sql select * from career_summary limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('aardsda01', 331.0, 0.0, 4.0, 0.0, 0.0, 0.0, 16.0, 18.0, 1011.0, 11.0, 29.0, 3.0, 'P'),
 ('aaronha01', 3298.0, 3173.0, 12364.0, 3771.0, 755.0, 2297.0, None, None, None, 7436.0, 429.0, 144.0, '1B,2B,3B,OF'),
 ('aaronto01', 437.0, 206.0, 944.0, 216.0, 13.0, 94.0, None, None, None, 1317.0, 113.0, 22.0, '1B,2B,3B,OF'),
 ('aasedo01', 448.0, 91.0, 5.0, 0.0, 0.0, 0.0, 66.0, 60.0, 3328.0, 67.0, 135.0, 13.0, 'P'),
 ('abadan01', 15.0, 4.0, 21.0, 2.0, 0.0, 0.0, None, None, None, 37.0, 1.0, 1.0, '1B,OF'),
 ('abadfe01', 363.0, 6.0, 9.0, 1.0, 0.0, 0.0, 8.0, 27.0, 953.0, 7.0, 37.0, 2.0, 'P'),
 ('abadijo01', 12.0, 0.0, 49.0, 11.0, 0.0, 5.0, None, None, None, 129.0, 3.0, 13.0, '1B'),
 ('abbated01', 857.0, 357.0, 3044.0, 772.0, 11.0, 324.0, None, None, None, 1873.0, 2368.0, 315.0, '2B,3B,OF,SS'),
 ('abbeybe01', 79.0, 0.0, 225.0, 38.0, 0.0, 17.0, 22.0, 40.0, 1704.0, 17.0, 134.0, 22.0, 'P'),
 ('abbeych01', 452.0, 0.0, 1756.0, 493.0, 19.0, 280.0, 0.0, 0.0, 6.0, 920.0, 92.0, 100.0, 'OF,P')]

## Update Statement (5 points)

- Make copies of the ```orders``` table in ```classicmodels.```


- The following statements will accomplish that.

In [24]:
%%sql
use classicmodels;
drop table if exists orders_copy;
create table orders_copy as select * from orders;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.
336 rows affected.

[]

- You can test of your copy worked by producing the same results as the following query.

In [25]:
%sql select * from orders_copy join orderdetails using(orderNumber) where orderNumber=10100;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
4 rows affected.

[(10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_1749', 30, Decimal('136.00'), 3),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_2248', 50, Decimal('55.09'), 2),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_4409', 22, Decimal('75.46'), 4),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S24_3969', 49, Decimal('35.29'), 1)]

- Write a single ```UPDATE``` statement that sets the status of all orders for customers to 'EMBARGOED' if:
    - The customer's address is in Australia And
    - The order's status is not SHIPPED or CANCELLED.
    

- Before the update, run the following query. You should get results that match the example.

In [26]:
%%sql
select
	customers.customerNumber, customers.country, orders_copy.orderNumber, orders_copy.status from
    customers join orders_copy
    using (customerNumber)
    where country = 'Australia'
order by status;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[(114, 'Australia', 10120, 'Shipped'),
 (114, 'Australia', 10125, 'Shipped'),
 (282, 'Australia', 10139, 'Shipped'),
 (276, 'Australia', 10148, 'Shipped'),
 (333, 'Australia', 10152, 'Shipped'),
 (276, 'Australia', 10169, 'Shipped'),
 (333, 'Australia', 10174, 'Shipped'),
 (471, 'Australia', 10193, 'Shipped'),
 (114, 'Australia', 10223, 'Shipped'),
 (471, 'Australia', 10265, 'Shipped'),
 (282, 'Australia', 10270, 'Shipped'),
 (114, 'Australia', 10342, 'Shipped'),
 (114, 'Australia', 10347, 'Shipped'),
 (282, 'Australia', 10361, 'Shipped'),
 (276, 'Australia', 10370, 'Shipped'),
 (333, 'Australia', 10374, 'Shipped'),
 (276, 'Australia', 10391, 'Shipped'),
 (471, 'Australia', 10415, 'Disputed'),
 (282, 'Australia', 10420, 'In Process')]

<u>Answer</u> Your update statement

In [27]:
%%sql

ALTER TABLE orders_copy
MODIFY status VARCHAR(15);

UPDATE orders_copy SET STATUS='EMBARGOED' 
WHERE STATUS NOT IN ('shipped', 'canceled') 
AND customerNumber IN (
	SELECT customerNumber from customers
    WHERE country = 'Australia'
);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
336 rows affected.
2 rows affected.

[]

- After running your update, run the following query to produce the same output as the example.

In [28]:
%%sql
select
	customers.customerNumber, customers.country, orders_copy.orderNumber, orders_copy.status from
    customers join orders_copy
    using (customerNumber)
    where country = 'Australia'
order by status;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
19 rows affected.

[(471, 'Australia', 10415, 'EMBARGOED'),
 (282, 'Australia', 10420, 'EMBARGOED'),
 (114, 'Australia', 10120, 'Shipped'),
 (114, 'Australia', 10125, 'Shipped'),
 (282, 'Australia', 10139, 'Shipped'),
 (276, 'Australia', 10148, 'Shipped'),
 (333, 'Australia', 10152, 'Shipped'),
 (276, 'Australia', 10169, 'Shipped'),
 (333, 'Australia', 10174, 'Shipped'),
 (471, 'Australia', 10193, 'Shipped'),
 (114, 'Australia', 10223, 'Shipped'),
 (471, 'Australia', 10265, 'Shipped'),
 (282, 'Australia', 10270, 'Shipped'),
 (114, 'Australia', 10342, 'Shipped'),
 (114, 'Australia', 10347, 'Shipped'),
 (282, 'Australia', 10361, 'Shipped'),
 (276, 'Australia', 10370, 'Shipped'),
 (333, 'Australia', 10374, 'Shipped'),
 (276, 'Australia', 10391, 'Shipped')]

# Data Modeling, Cleanup and Implementation

## Classicmodels Orders (5 points)


- There is a glaringly obvious design problem that could compromise data integrity in the table ```classicmodels.orders.```


- The current schema is:
```
CREATE TABLE `orders` (
  `orderNumber` int(11) NOT NULL,
  `orderDate` date NOT NULL,
  `requiredDate` date NOT NULL,
  `shippedDate` date DEFAULT NULL,
  `status` varchar(15) NOT NULL,
  `comments` text,
  `customerNumber` int(11) NOT NULL,
  PRIMARY KEY (`orderNumber`),
  KEY `customerNumber` (`customerNumber`),
  CONSTRAINT `orders_ibfk_1` FOREIGN KEY (`customerNumber`) REFERENCES `customers` (`customerNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
```


- Alter the schema to correct the issue, and test your correction.

<u>Answer</u>

Column `status` shouldn't be in a free form of `varchar(15)`. Its value should be restricted only to some valid values. <br> The valid values can be retrieved using a `SELECT` statement below.

In [29]:
%%sql 

USE classicmodels;

SELECT DISTINCT status FROM orders;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
6 rows affected.

[('Shipped',),
 ('Resolved',),
 ('Cancelled',),
 ('On Hold',),
 ('Disputed',),
 ('In Process',)]

Using above values, we can alter column `status` to have the type of `enum`.

In [30]:
%%sql

ALTER TABLE orders
MODIFY COLUMN `status` 
ENUM('Shipped', 'Resolved', 'Cancelled', 'On Hold', 'Disputed', 'In Process') 
NOT NULL;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

Let's use this particular row for the testing.

In [31]:
%sql SELECT status FROM orders WHERE orderNumber = 10420;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[('In Process',)]

Let's test the correction using a query that set `status` to an invalid value

In [32]:
try:
    %sql UPDATE orders SET status = 'Random Status' WHERE orderNumber = 10420;
    print("Getting here is bad.")
except Exception as e:
    print("This is OK, e = ", e)

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
This is OK, e =  (pymysql.err.DataError) (1265, "Data truncated for column 'status' at row 1")
[SQL: UPDATE orders SET status = 'Random Status' WHERE orderNumber = 10420;]
(Background on this error at: http://sqlalche.me/e/9h9h)

Let's test again our correction using a query that set `status` to a valid value

In [33]:
try:
    %sql UPDATE orders SET status = 'Shipped' WHERE orderNumber = 10420;
    print("This is OK")
except Exception as e:
    print("Getting here is bad, e = ", e)

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.
This is OK

In [34]:
# Set back the row status to its original value
%sql UPDATE orders SET status = 'In Process' WHERE orderNumber = 10420;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[]

## Data Cleanup (10 Points)

- There are international standards for two letter country codes, e.g. ISO 3166-1.


- datahub.io has [down-loadable versions](https://datahub.io/core/country-list) of the information.


- The first part of answering this question is downloading the country code, country name information, and loading into a table in classicmodels.


- After a successful load, a sample query produces.

In [35]:
# Note that I don't import countrycodes via script here, I did it using MySQL workbench interface
# I used this CSV: https://pkgstore.datahub.io/core/country-list/data_csv/data/d7c9d7cfb42cb69f4422dec222dbbaa8/data_csv.csv
# It should give a table called countrycodes (Name, Code) with total of 249 rows
# After importing country code csv to MySQL, check with this query below
%sql SELECT * FROM classicmodels.countrycodes limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('Andorra', 'AD'),
 ('United Arab Emirates', 'AE'),
 ('Afghanistan', 'AF'),
 ('Antigua and Barbuda', 'AG'),
 ('Anguilla', 'AI'),
 ('Albania', 'AL'),
 ('Armenia', 'AM'),
 ('Angola', 'AO'),
 ('Antarctica', 'AQ'),
 ('Argentina', 'AR')]

- Allowing people to enter country names as free form text is an extremely bad idea. People will enter things like 'USA,' 'US', 'U.S. of A.', 'United States,' ...


- We are going to modify a copy of ```classicmodels.customers``` to have better integrity.


- The first step is to create a copy of ```classicmodels.customers.```

In [36]:
# I add DROP TABLE statement so that I can run this multiple times
%sql DROP TABLE IF EXISTS classicmodels.customers_clean
%sql create table classicmodels.customers_clean as select * from classicmodels.customers;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
122 rows affected.

[]

In [37]:
%sql select customerNumber, customerName, country from classicmodels.customers_clean limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[(103, 'Atelier graphique', 'France'),
 (112, 'Signal Gift Stores', 'USA'),
 (114, 'Australian Collectors, Co.', 'Australia'),
 (119, 'La Rochelle Gifts', 'France'),
 (121, 'Baane Mini Imports', 'Norway'),
 (124, 'Mini Gifts Distributors Ltd.', 'USA'),
 (125, 'Havel & Zbyszek Co', 'Poland'),
 (128, 'Blauer See Auto, Co.', 'Germany'),
 (129, 'Mini Wheels Co.', 'USA'),
 (131, 'Land of Toys Inc.', 'USA')]

- You must produce a table that looks like the following, and implements referential integrity.

###### Explanation

1. First, set the column `code` in `countrycodes` as the primary key. This is done in three steps: <br>
    - Drop any current primary key. This is only needed because I run this script multiple times.
    - Change column `code` from type `text` to `varchar(2)`. Primary key cannot be text.
    - Add column `code` as the primary key.
    <br><br>
2. Second, set the column `customerNumber` in `customers_clean` as the primary key.
    <br><br>
3. Third, add `country_code` column in `customers_clean`. We can set it as `varchar(2)`, same as the one in `countrycodes`.
    <br><br>
4. Finally, we can apply referential integrity from foreign key `customers_clean(country_code)` to `countrycodes(code)`;
    <br><br>
5. We need to keep `country` column in `customers_clean` to set `country_code` for existing rows and then drop it afterwards.

In [38]:
%sql USE classicmodels;

try:
    %sql ALTER TABLE countrycodes DROP PRIMARY KEY;
except:
    print('countrycodes does not have primary key already')
    
%sql ALTER TABLE countrycodes MODIFY COLUMN code VARCHAR(2);
    
%sql ALTER TABLE countrycodes ADD PRIMARY KEY (code);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
249 rows affected.
 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

In [39]:
%%sql

ALTER TABLE customers_clean
ADD PRIMARY KEY (customerNumber);

ALTER TABLE customers_clean
ADD COLUMN country_code VARCHAR(2);

ALTER TABLE customers_clean
ADD CONSTRAINT country_code FOREIGN KEY (country_code) REFERENCES countrycodes(code);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.
122 rows affected.

[]

I notice that there are three country names that are not listed in table countrycodes, which are:

In [40]:
%%sql SELECT DISTINCT country FROM customers_clean WHERE country NOT IN (
    SELECT name FROM countrycodes
);

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
3 rows affected.

[('USA',), ('UK',), ('Russia',)]

Thus, before setting `country_code` values in `customers_clean` based on `countrycodes` table, we need to update manually some values.
<br>
This is needed so that there won't be any `NULL country_code` in `customers_clean` after we update `customers_clean` using `countrycodes`.
<br>
Also, we need to disable `SQL_SAFE_UPDATES` since we update based on non-primary key column `country`.

In [41]:
%%sql
SET SQL_SAFE_UPDATES = 0;
UPDATE customers_clean SET country = 'United States' WHERE country = 'USA';
UPDATE customers_clean SET country = 'United Kingdom' WHERE country = 'UK';
UPDATE customers_clean SET country = 'Russian Federation' WHERE country = 'Russia';
SET SQL_SAFE_UPDATES = 1;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
36 rows affected.
5 rows affected.
1 rows affected.
0 rows affected.

[]

We can then finally set the `country_code` values. This can be achieved by applying join on `country` name.

In [42]:
%%sql
SET SQL_SAFE_UPDATES = 0;

UPDATE customers_clean 
INNER JOIN countrycodes
ON customers_clean.country = countrycodes.name
SET customers_clean.country_code = countrycodes.code;

SET SQL_SAFE_UPDATES = 1;

ALTER TABLE customers_clean
DROP COLUMN country;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
122 rows affected.
0 rows affected.
0 rows affected.

[]

In [43]:
%sql select * from classicmodels.customers_clean limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 1370, Decimal('21000.00'), 'FR'),
 (112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 1166, Decimal('71800.00'), 'US'),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 1611, Decimal('117300.00'), 'AU'),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 1370, Decimal('118200.00'), 'FR'),
 (121, 'Baane Mini Imports', 'Bergulfsen', 'Jonas ', '07-98 9555', 'Erling Skakkes gate 78', None, 'Stavern', None, '4110', 1504, Decimal('81700.00'), 'NO'),
 (124, 'Mini Gifts Distributors Ltd.', 'Nelson', 'Susan', '4155551450', '5677 Strong St.', None, 'San Rafael', 'CA', '97562', 1165, Decimal('210500.00'), 'US'),
 (125, 'Havel & Zbyszek Co', 'Piestrzeniewicz', 'Zbyszek ', '(26) 642-7555', 'ul. Filtrowa 68', None, 'Warszawa', None, '01-012', None, Decimal('0.00'), 'PL'),
 (128, 'Blauer See Auto, Co.', 'Keitel', 'Roland', '+49 69 66 90 2555', 'Lyonerstr. 34', None, 'Frankfurt', None, '60528', 1504, Decimal('59700.00'), 'DE'),
 (129, 'Mini Wheels Co.', 'Murphy', 'Julie', '6505555787', '5557 North Pendale Street', None, 'San Francisco', 'CA', '94217', 1165, Decimal('64600.00'), 'US'),
 (131, 'Land of Toys Inc.', 'Lee', 'Kwai', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 1323, Decimal('114900.00'), 'US')]

We can see that exception happens when we try to update using invalid `country_code` 'XX'.

In [44]:
try:
    %sql update customers_clean set country_code = 'XX' where customerNumber=103
    print("Getting here is bad.")
except Exception as e:
    print("This is OK, e = ", e)

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
This is OK, e =  (pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`classicmodels`.`customers_clean`, CONSTRAINT `country_code` FOREIGN KEY (`country_code`) REFERENCES `countrycodes` (`code`))')
[SQL: update customers_clean set country_code = 'XX' where customerNumber=103]
(Background on this error at: http://sqlalche.me/e/gkpj)

This one is really unpleasant!

<u>Answer</u>

- This one is really unpleasant.


- The character sets might be a problem.

```
My answers are in above cells.
```

When inserting using valid values, no exception occurs

In [45]:
%sql update customers_clean set country_code = 'US' where customerNumber=103

# Set back to original value
%sql update customers_clean set country_code = 'FR' where customerNumber=103

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.
 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[]

## E-R Diagrams (5 points)

- __Note:__ Please use Crow's Foot notation for this diagram.


- The model has the following entity types:
    - Student(uni, last_name, first_name)
    - Course(course_id, course_name)
    - Section(section_number, semester, year, course_id)
    
    
- Draw a logical ER diagram representing the data model. You do not have to worry about column types.


- The model MUST represent student enrollments.


- You may need to create an additional table.

<u>Answer</u>

##### Explanation:

1. Tables and Primary Keys

    a. Table Student will have uni as the primary key <br><br>
    b. Table Course will have course_id as the primary key <br><br>
    c. Table Section will have composite primary key -> (section_number, semester, year). This is because we can have the same section_number for different semester and year, e.g. (001, Fall, 2019) and (001, Spring, 2020). <br>
<br>
2. Relationships and Foreign Keys

    a. Course and Section will have one to many relationship as course can be offered in more than one sections and in many different semesters and years. Section will have foreign key course_id pointing to Course. <br><br>
    b. Student and Section will have many to many relationship, with student is at least enrolled in one section and each section can have zero or more students. Thus, we need to add another table/relationship to break down this many to many relationship. <br><br>
    c. I create a table called Enrollment that represents Student and Section relationship. Student will at least appear one time in Enrollment, so we have one to many relationship between Student and Enrollment. For Section, since there is a possibility that no students are enrolled, then Section and Enrollment will have one to many (possibly zero) relationship. <br><br>
    d. Enrollment will have a composite primary key (student_uni, section_number, section_semester, section_year). This primary key also acts as a foreign key. The first element will point to student meanwhile the last three elements will point to Section. I add an additional column grade so that not all columns of Enrollment are primary keys.

<img src="./ER Diagram.png?">

## Inheritance and Stored Procedures (10 points)

- The two following table definitions are a simple model for people at a university.

```
CREATE TABLE `student` (
  `student` varchar(12) NOT NULL,
  `last_name` varchar(64) NOT NULL,
  `first_name` varchar(64) NOT NULL,
  `graduation_year` year(4) NOT NULL,
  PRIMARY KEY (`student`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;


CREATE TABLE `faculty` (
  `uni` varchar(12) NOT NULL,
  `last_name` varchar(64) NOT NULL,
  `first_name` varchar(64) NOT NULL,
  `title` enum('Professor','Assistant Professor','Associate Professor','Adjunct Professor') NOT NULL,
  PRIMARY KEY (`uni`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

```

- Implement a view ```People``` that supports ```SELECT``` for the following columns:
    - UNI
    - last_name
    - first_name
    - Type is 'S' if the person is a student and 'F' if the person is a faculty.
    - 'NA' for graduation year if the person is not a student.
    - 'NA' for title if the person is not a faculty.
    
    
- Write a stored procedure that:
    - Inserts the data in the proper table based on the type.
    - Generates a unique UNI for a newly inserted person.
    
    
- You do not need to worry about error checking parameters, types, etc.
    
    
<u>Answer</u>

```
Answers are in cells below.

```

1. Create table `student` and `faculty` in `classicmodels` schema since no tables with the same name exist there<br><br>
2. Insert two dummy records for testing

In [46]:
%%sql

USE classicmodels;

DROP TABLE IF EXISTS `student`;
DROP TABLE IF EXISTS `faculty`;

CREATE TABLE `student` (
  `student` varchar(12) NOT NULL,
  `last_name` varchar(64) NOT NULL,
  `first_name` varchar(64) NOT NULL,
  `graduation_year` year(4) NOT NULL,
  PRIMARY KEY (`student`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

CREATE TABLE `faculty` (
  `uni` varchar(12) NOT NULL,
  `last_name` varchar(64) NOT NULL,
  `first_name` varchar(64) NOT NULL,
  `title` enum('Professor','Assistant Professor','Associate Professor','Adjunct Professor') NOT NULL,
  PRIMARY KEY (`uni`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO `student` VALUES ('gd2551', 'dzakwan', 'geraldi', '2020');

INSERT INTO `faculty` VALUES ('yb2235', 'benajiba', 'yassine', 'Adjunct Professor');

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.

[]

Create People View

In [47]:
%%sql

DROP VIEW IF EXISTS People;

CREATE VIEW People (uni, last_name, first_name, type, graduation_year, title) AS
	SELECT student as uni, last_name, first_name, 'S', graduation_year, 'NA' FROM student
	UNION ALL
	SELECT uni, last_name, first_name, 'F', 'NA', title FROM faculty;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.

[]

In [48]:
# Test People view
%sql SELECT * FROM People;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
2 rows affected.

[('gd2551', 'dzakwan', 'geraldi', 'S', '2020', 'NA'),
 ('yb2235', 'benajiba', 'yassine', 'F', 'NA', 'Adjunct Professor')]

Build helper function to generate uni
<br><br>
This is copied from Prof. Ferguson's lecture, with a slight modification denoted in the comment below

In [49]:
%%sql

DROP FUNCTION IF EXISTS generate_uni;  

CREATE DEFINER=`dbuser`@`localhost` FUNCTION `generate_uni`(first_name varchar(64), last_name varchar(64)) RETURNS varchar(12) CHARSET utf8 deterministic
BEGIN

    declare f_prefix varchar(2);
    declare l_prefix varchar(2);
    declare prefix_count int;
    declare full_prefix varchar(5);
    declare result varchar(12);


    set f_prefix = lower(substr(first_name, 1, 2));
    set l_prefix = lower(substr(last_name, 1, 2));

    set full_prefix = concat(f_prefix, l_prefix, '%');

    # Change the table to People view here
    set prefix_count = (select count(*) as count from people where uni like(full_prefix));

    set result = concat(f_prefix, l_prefix, prefix_count+1);

    return result;

END

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

[]

Create the stored procedure
<br><br>
Design decision: the last parameter can be filled by either graduation_year or title
<br><br>
I assume that if type is S then user will provide graduation year and if type is F then user will provide title

In [50]:
%%sql

DROP PROCEDURE IF EXISTS create_person;  

CREATE DEFINER=`dbuser`@`localhost` PROCEDURE `create_person`(
    in last_name varchar(64), in first_name varchar(64), 
    in type varchar(1), in grad_year_or_title varchar(20))

BEGIN

    DECLARE new_uni varchar(12);
    
    SET new_uni = generate_uni(first_name, last_name);
    
    IF type = 'S' THEN INSERT INTO student VALUES (new_uni, last_name, first_name, grad_year_or_title);
    
    ELSEIF type = 'F' THEN INSERT INTO faculty VALUES (new_uni, last_name, first_name, grad_year_or_title);
    
    END IF;

END

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.

[]

In [51]:
# Test stored procedure
%sql call create_person('Ferguson', 'Donald', 'F', 'Professor');
%sql call create_person('Zakia', 'Lulu', 'S', '2021');

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.
 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
1 rows affected.

[]

In [52]:
# Testing if insert works
%sql SELECT * FROM People

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
4 rows affected.

[('gd2551', 'dzakwan', 'geraldi', 'S', '2020', 'NA'),
 ('luza1', 'Zakia', 'Lulu', 'S', '2021', 'NA'),
 ('dofe1', 'Ferguson', 'Donald', 'F', 'NA', 'Professor'),
 ('yb2235', 'benajiba', 'yassine', 'F', 'NA', 'Adjunct Professor')]

## Putting Some Pieces Together (5 points)

- The following is the current definition for ```lahman2019.salaries.```

```
CREATE TABLE `salaries` (
  `yearID` text,
  `teamID` text,
  `lgID` text,
  `playerID` text,
  `salary` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

```

- Create a copy of the data into ```salaries_clean.```


- Transform the definition to improve integrity, making whatever changes you think necessary. The changes will require modifying column types, check constraints/triggers to ensure values are valid, and foreign key constraints.


<u>Answer</u>

```
USE lahman2019clean;

DROP TABLE IF EXISTS salaries_clean;

CREATE TABLE `salaries_clean` (
   `yearID` varchar(4),
   `teamID` varchar(4),
   `lgID` varchar(2),
   `playerID` varchar(16),
   `salary` int unsigned,
   PRIMARY KEY (playerID, teamID, yearID),
   FOREIGN KEY (playerID) REFERENCES People(playerID),
   FOREIGN KEY (teamID, yearID) REFERENCES Teams(teamID, yearID)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO salaries_clean
SELECT * FROM salaries;

```

##### Explanation

1. `yearID` is changed into `varchar(4)` because all yearIDs are composed of four characters. We can easily check this using ```SELECT DISTINCT LENGTH(yearID) FROM Teams;```. I don't set the type to `year(4)` because it will be incompatible when I later try to set this as a foreign key to table `Teams`. The column `yearID` in table `Teams` has the type of `varchar(4)`.
<br><br>
2. `teamID` is changed into `varchar(4)` to match `teamID` type in table `Teams` so that I can make a foreign key reference later. All `teamID`s have only 3 characters so we waste 1 character here. We can easily check this using ```SELECT DISTINCT LENGTH(teamID) FROM Teams;```.
<br><br>
3. `lgID` type is changed into `varchar(2)` because all `lgID`s are composed of two characters. We can easily check this using ```SELECT DISTINCT LENGTH(lgID) FROM Teams;```.
<br><br>
4. `playerID` type is changed into `varchar(16`) to match `playerID` type in table `People` so that I can make a foreign key reference later.
<br><br>
5. `salary` type is changed into `int unsigned` because salary is always a positive integer.
<br><br>
6. There are two options for the primary key, either ```(playerID, teamID, yearID, lgID)``` or ```(playerID, teamID, yearID)```. Both define unique rows for table `Salaries`. We can check that using 
```SELECT playerID, teamID, yearID, lgID, COUNT(1) FROM salaries GROUP BY playerID, teamID, yearID, lgID HAVING COUNT(1) > 1;
``` 
and 
```SELECT playerID, teamID, yearID, COUNT(1) FROM salaries GROUP BY playerID, teamID, yearID HAVING COUNT(1) > 1;```. But, I decide to pick `(playerID, teamID, yearID)` because it is shorter. Another reason is that in other tables, such as `Teams` and `Appearances`, `lgID` is also not included in the primary key.
<br><br>
7. There are some options to define the foreign key, such as to point to table `People` and `Teams` or to table `Appearances`. But, pointing to table `Appearances` might not be appropriate because there are some players in table `Salaries` that are not in table `Appearances`. We can check that using this query: <br>
```SELECT playerID, teamID, yearID, salary FROM salaries WHERE NOT EXISTS (
	SELECT playerID, teamID, yearID FROM appearances
	WHERE salaries.playerID = appearances.playerID AND salaries.teamID = appearances.teamID AND salaries.yearID =   appearances.yearID
);```.

## Graph Data $-$ Game of Thrones

- The GitHub repository https://github.com/melaniewalsh/sample-social-network-datasets/tree/master/sample-datasets/game-of-thrones contains data for a graph of relationships between characters in _Game of Thrones._
    - The file _got-nodes.csv_ contains simple information about characters.
    - The file _got-edges.csv_ contains information about relationships between characters.
    
    
- The [README](https://github.com/melaniewalsh/sample-social-network-datasets/blob/master/sample-datasets/game-of-thrones/README.md) explains the meaning of the files and fields.


- Load the data:
    - Create a new database _W4111Midterm_ in your MySQL instance.
    - Use the Table Data import tool to load the CSV files into tables named:
        - _got_nodes_
        - _got_edges_
        

- After loading, your sample data should look like the examples below.

In [53]:
%sql select * from W4111Midterm.got_nodes limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('Id', 'Label'),
 ('Aemon', 'Aemon'),
 ('Grenn', 'Grenn'),
 ('Samwell', 'Samwell'),
 ('Aerys', 'Aerys'),
 ('Jaime', 'Jaime'),
 ('Robert', 'Robert'),
 ('Tyrion', 'Tyrion'),
 ('Tywin', 'Tywin'),
 ('Alliser', 'Alliser')]

In [54]:
%sql select * from W4111Midterm.got_edges limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
10 rows affected.

[('Aemon', 'Grenn', 5),
 ('Aemon', 'Samwell', 31),
 ('Aerys', 'Jaime', 18),
 ('Aerys', 'Robert', 6),
 ('Aerys', 'Tyrion', 5),
 ('Aerys', 'Tywin', 8),
 ('Alliser', 'Mance', 5),
 ('Amory', 'Oberyn', 5),
 ('Arya', 'Anguy', 11),
 ('Arya', 'Beric', 23)]

- Wanted to know the shortest path in the data between two obscure characters: Roose, Craster.


- So, I asked my wizard friend.

| <img src="./wizard_graph.png"> |
| :---: |
| __Advanced Magic__ |


- I did not understand the spell. I have been teaching SQL. 


- But, I know giant class of wizards comfortable with SQL magic. So, I decided to ask them to show me the spell.

- So, the exam question is, "Show me an SQL spell that returns the information."


- There is a spell that is a single SQL statement, but the aliasing will drive you nuts.


- You may create tables that compute partial results.

<u>Answer</u>

Create a table that represents bidirectional edges

In [55]:
%%sql
USE W4111Midterm;

DROP TABLE IF EXISTS all_edges;

CREATE TABLE all_edges AS
    SELECT source, target FROM got_edges
    UNION
    SELECT target, source FROM got_edges
;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
0 rows affected.
704 rows affected.

[]

Create a table that represents all possible paths after one hop
<br><br>
We will add a where clause to select only paths that start with Roose or Craster because we are particularly interested in that

In [56]:
%%sql

DROP TABLE IF EXISTS one_hop;

CREATE TABLE one_hop AS
    SELECT t1.source as source_one, t1.target as target_one,
    t2.source as source_two, t2.target as target_two
    FROM all_edges AS t1
    JOIN all_edges AS t2
    ON t1.target = t2.source
    WHERE t1.source = 'Roose' or t1.source = 'Craster'
;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
127 rows affected.

[]

Check if there is any path at one hop that starts with Roose and ends with Craster or vice versa

In [57]:
%%sql

SELECT * FROM one_hop WHERE (source_one = 'Roose' AND target_two = 'Craster') OR (source_one = 'Craster' AND target_two = 'Roose')

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.

[]

Because there are no such rows at one hop, let's try for two hops

In [58]:
%%sql

DROP TABLE IF EXISTS two_hops;

CREATE TABLE two_hops AS
    SELECT source_one, target_one, source_two, target_two,
    t2.source as source_threee, t2.target as target_three
    FROM one_hop AS t1
    JOIN all_edges AS t2
    ON t1.target_two = t2.source
;

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
0 rows affected.
1416 rows affected.

[]

Check if there is any path at two hops that starts with Roose and ends with Craster or vice versa

In [59]:
%%sql

SELECT * FROM two_hops WHERE (source_one = 'Roose' AND target_three = 'Craster') OR (source_one = 'Craster' AND target_three = 'Roose')

 * mysql+pymysql://dbuser:***@localhost/lahman2019clean
4 rows affected.

[('Craster', 'Jon', 'Jon', 'Arya', 'Arya', 'Roose'),
 ('Roose', 'Arya', 'Arya', 'Jon', 'Jon', 'Craster'),
 ('Roose', 'Robb', 'Robb', 'Jon', 'Jon', 'Craster'),
 ('Craster', 'Jon', 'Jon', 'Robb', 'Robb', 'Roose')]

Finally, we get them.
<br><br>
So, the shortest path takes two hops and all the possible paths (4 in total) are displayed above.